from summary.config import textAllSummaryPromptStart, textAllSummaryPromptEnd
from summary.text_sum.core import TextSummaryWorker
from summary.util.create_llm import get_llm


class allTextSummaryWorker(TextSummaryWorker):
    def summary(self, text=None, title=None, info=None, PromptStart=textAllSummaryPromptStart,
                PromptEnd=textAllSummaryPromptEnd):
        llm = get_llm()

        all_info = text
        if title:
            all_info += "\n视频标题:" + title
        if info:
            all_info += "\n视频关键字备注:" + info
        this_prompt = PromptStart + all_info + PromptEnd
        print("开始生成总体纪要:\n")
        textAllSummary = llm.invoke(this_prompt).content
        # print(textAllSummary)
        return textAllSummary


if __name__ == '__main__':
    title = "会议纪要"
    info = "AI大模型"
    text = """[0.00s -> 7.00s] 你用 PS 做吧
[7.00s -> 12.00s] 所以用 PS 学一下基本的打开
[12.00s -> 18.00s] 你 PS 做的语言
[18.00s -> 22.00s] 应该是呀
[22.00s -> 26.00s] 你们做的
[26.00s -> 27.00s] 嗯
[30.00s -> 37.00s] OK
[37.00s -> 38.00s] 都可以投啊
[38.00s -> 41.00s] 主要用你在台我等一下可能要远程我那个电脑
[41.00s -> 45.00s] 他这个没办法远程
[45.00s -> 52.00s] 这个线的问题
[52.00s -> 59.00s] 这问题出了话也没办法
[59.00s -> 60.00s] 好
[60.00s -> 70.00s] 提出这么差
[70.00s -> 73.00s] 将就看吧将就看吧
[73.00s -> 75.00s] 同志小会议室
[75.00s -> 85.00s] 你也没多久啊
[85.00s -> 87.00s] 你目前不知道
[87.00s -> 89.00s] 你
[89.00s -> 95.00s] 有可能
[95.00s -> 99.00s] 有可能
[99.00s -> 101.00s] 他这个电脑也是很多问题
[101.00s -> 108.00s] 保险公司的电脑很多都有问题
[108.00s -> 113.00s] 真的是真的是
[113.00s -> 115.00s] 看领导
[115.00s -> 116.00s] 看领导
[116.00s -> 119.00s] 你真的是要做太多了
[119.00s -> 120.00s] 就是跟你们一样的
[120.00s -> 121.00s] 对
[121.00s -> 123.00s] 他下来还是采购来的
[123.00s -> 124.00s] 不是不是
[124.00s -> 125.00s] 以前就
[125.00s -> 126.00s] 就
[126.00s -> 127.00s] 那
[127.00s -> 128.00s] 那
[128.00s -> 129.00s] 去那种回收段
[129.00s -> 130.00s] 没有回收
[130.00s -> 131.00s] 嗯
[131.00s -> 132.00s] 回收过来
[132.00s -> 133.00s] 嗯
[133.00s -> 137.00s] 那这个访问方式就大概是这样
[137.00s -> 138.00s] 然后模型
[138.00s -> 141.00s] 主要是两个
[141.00s -> 142.00s] 两个地址嘛
[142.00s -> 144.00s] 一个国内的liblib
[144.00s -> 145.00s] 点art或者点AI
[145.00s -> 147.00s] 这个网址
[147.00s -> 149.00s] 还有一个是国外的一个叫西战
[149.00s -> 154.00s] 这个国外这个网站要通过翻墙才能访问
[154.00s -> 158.00s] 要要翻墙
[158.00s -> 159.00s] 这个找公司
[159.00s -> 163.00s] 这个要找公司
[163.00s -> 166.00s] 这个就是他大概的一个界面嘛
[166.00s -> 167.00s] 一个绘画的界面
[167.00s -> 172.00s] 然后等一下我们就是从这个各个参数开始开始讲
[172.00s -> 175.00s] 首先看这个红框的这个地方
[175.00s -> 176.00s] 红色框
[176.00s -> 177.00s] 左上角
[177.00s -> 181.00s] 他这个地方就是用来选择他的一个基础大模型的地方
[181.00s -> 186.00s] 像现在是选择一个叫万象熔炉的
[186.00s -> 187.00s] 嗯
[187.00s -> 190.00s] 然后旁边的绿框处叫一个叫VAE
[190.00s -> 192.00s] 他这个中文叫
[192.00s -> 193.00s] 变分字编码器
[193.00s -> 195.00s] 这个是
[195.00s -> 196.00s] 比较专业的名词啊
[196.00s -> 198.00s] 一般是
[198.00s -> 199.00s] 不怎么用得到
[199.00s -> 201.00s] 我平常用也不怎么用到
[201.00s -> 204.00s] 就用默认的一个O2就可以了
[204.00s -> 209.00s] 他这个绿框这个就是他的作用就是
[209.00s -> 210.00s] 像一个滤镜一样
[210.00s -> 217.00s] 他就是能够帮我们的图片就是可以生成一个更鲜艳的更锐利的图像
[217.00s -> 218.00s] 这个一般来说
[218.00s -> 220.00s] 他大模型里面有自带
[220.00s -> 223.00s] 或者只有在大模型里面的这个VAE
[223.00s -> 229.00s] 他出问题或者说不符合我们效果的时候才会去做这个模型的替换VAE的替换
[229.00s -> 232.00s] 所以说这个一般是用默认的
[234.00s -> 240.00s] 然后这个是Lora模型
[240.00s -> 244.00s] 他这个选择这个框是在下方
[244.00s -> 246.00s] 刚刚那个图片的下方
[246.00s -> 249.00s] 这边有个Lora可以选
[249.00s -> 253.00s] 他这边就展示了现在已经安装的三个Lora模型
[253.00s -> 258.00s] 他这里面的模型主要是以两个嘛
[258.00s -> 259.00s] 一个是刚刚讲的大模型
[259.00s -> 261.00s] 还有一个就是这个Lora模型
[261.00s -> 262.00s] 大模型
[262.00s -> 263.00s] 基础大模型就是
[263.00s -> 266.00s] 通过训练出来的一个图片合集
[266.00s -> 269.00s] 这个checkpoint体积会比较大
[269.00s -> 271.00s] 一般在7个G左右
[271.00s -> 273.00s] 但如果说24元的
[273.00s -> 274.00s] 或者说动漫版的
[274.00s -> 276.00s] 一般在2到5个G之间
[276.00s -> 278.00s] 现在大模型也区分
[278.00s -> 280.00s] 这个模型也区分一个叫XL
[280.00s -> 282.00s] 或者说一个是XL
[282.00s -> 283.00s] 还有一个是1.5
[283.00s -> 285.00s] 这两个模型是不同的
[285.00s -> 286.00s] 通常来说
[286.00s -> 291.00s] XL模型它的效果或者说质量
[291.00s -> 293.00s] 出图的效果跟质量会比较好一点
[293.00s -> 297.00s] 1.5的可能会没那么好
[297.00s -> 299.00s] 就是对于中文理解能力
[299.00s -> 302.00s] 对于这个提示词的理解能力
[302.00s -> 305.00s] 然后Lora这就是一个体积比较小的绘画模型
[305.00s -> 307.00s] 就是可以理解成微调
[307.00s -> 310.00s] 就是一个对大模型的微调
[310.00s -> 313.00s] 它就是可以在以选择的大模型基础上
[313.00s -> 316.00s] 添加一个或者说多个Lora模型
[316.00s -> 321.00s] 对图片进行一个微调
[321.00s -> 324.00s] 就是需要不同风格的图片
[324.00s -> 330.00s] 就可以放上不同风格的这种Lora模型上去
[330.00s -> 331.00s] 要使用的话呢
[331.00s -> 334.00s] 就是直接点进来这个地方
[334.00s -> 335.00s] 点一下
[335.00s -> 337.00s] 然后上面的提示词
[337.00s -> 341.00s] 它就会自动的输进去
[341.00s -> 343.00s] 没有提示词需要我们输入
[343.00s -> 345.00s] 你想要啥
[345.00s -> 347.00s] 对
[347.00s -> 349.00s] 这个就是关键
[349.00s -> 350.00s] 对
[350.00s -> 352.00s] 像红色的衣服啊
[352.00s -> 353.00s] 对
[353.00s -> 354.00s] 你想画什么
[354.00s -> 357.00s] 它你就输什么提示词进去
[357.00s -> 358.00s] 对
[358.00s -> 359.00s] 对
[363.00s -> 365.00s] 首先就是选择这个大模型
[365.00s -> 366.00s] SD模型
[366.00s -> 369.00s] 然后再选择一下采样器
[369.00s -> 372.00s] 还有写一下提示词等
[372.00s -> 375.00s] 然后如果说要让Lora模型产生效果
[375.00s -> 379.00s] 就是还要写一下这个触发
[379.00s -> 380.00s] Lora这个
[380.00s -> 382.00s] 触发Lora模型的关键词
[382.00s -> 385.00s] 它这个在那个Lora模型上面点一下
[385.00s -> 387.00s] 它就会自动写到提示词里面去了
[387.00s -> 391.00s] 它这个大概的格式给大家讲一下
[391.00s -> 393.00s] 就是它这个一般来说
[393.00s -> 395.00s] 外面一个是肩口号
[395.00s -> 397.00s] 然后一个Lora猫号
[397.00s -> 399.00s] 然后一个模型的触发词
[399.00s -> 401.00s] 它这个基本上是固定的
[401.00s -> 403.00s] 然后影响权重
[403.00s -> 404.00s] 这个可能要我们改
[404.00s -> 407.00s] 就比如说下面这个是1嘛
[407.00s -> 409.00s] 肩口号那边有个1吧
[409.00s -> 413.00s] 这个1就代表着你影响的权重
[413.00s -> 416.00s] 这一般来说这个值是在0到1之间
[416.00s -> 419.00s] 如果说你用多个Lora模型的话
[419.00s -> 424.00s] 也是要在它这个权重的总和也是要在1
[424.00s -> 428.00s] 不然的话它这个触动的效果就会有问题
[428.00s -> 430.00s] 就比如说
[430.00s -> 434.00s] 三调直接改
[434.00s -> 436.00s] 就比如说你两个模型
[436.00s -> 438.00s] 一个权重0.4
[438.00s -> 441.00s] 那另一个权重就要0.6
[441.00s -> 445.00s] 大概这样
[445.00s -> 447.00s] 对
[447.00s -> 448.00s] 固定的
[448.00s -> 455.00s] 对每个模型都有一个固定值
[455.00s -> 457.00s] 然后有一些部分的Lora模型
[457.00s -> 459.00s] 还要添加一下提示词
[459.00s -> 461.00s] 触发词
[461.00s -> 463.00s] 像右边这个图
[463.00s -> 468.00s] 它是一个Libre上面的一个Lora模型的一个视力图嘛
[468.00s -> 471.00s] 然后它这边有一个权重建议
[471.00s -> 473.00s] 它这个权重这个模型的Lora
[473.00s -> 477.00s] 权重建议是0.65到0.9之间
[477.00s -> 481.00s] 然后下面它有写了一个触发词
[481.00s -> 484.00s] 这个不知道什么英文
[484.00s -> 486.00s] 然后还有一些其他的参数
[486.00s -> 488.00s] 它也会给我们写出来
[488.00s -> 491.00s] 比如说采样步数
[491.00s -> 493.00s] 还有这个相关性
[493.00s -> 495.00s] 相关性就是这个CFG
[495.00s -> 497.00s] 7到8之间
[497.00s -> 500.00s] 然后尺寸图片的尺寸也是要基本上固定的
[500.00s -> 504.00s] 像1.5模型的尺寸基本上是在512乘512
[504.00s -> 507.00s] 或者说512乘768
[507.00s -> 511.00s] 像XL模型它基本上是512乘1024
[511.00s -> 513.00s] 或者说其他更大一点
[513.00s -> 515.00s] 像它那个尺寸
[515.00s -> 517.00s] 它图片的尺寸大小基本上都会在
[517.00s -> 522.00s] 模型的介绍栏里面有给我们写出来
[522.00s -> 523.00s] 可以修改大小
[523.00s -> 526.00s] 但是你如果不按它的大小出来的话
[526.00s -> 527.00s] 它
[527.00s -> 529.00s] 试试质量会有问题
[529.00s -> 531.00s] 如果说你
[531.00s -> 533.00s] 对
[533.00s -> 535.00s] 如果说你最后想要一个
[535.00s -> 537.00s] 分辨率比较大的图可以用
[537.00s -> 539.00s] 那个分辨率放大
[539.00s -> 541.00s] 里面有一个功能就是
[541.00s -> 543.00s] 把图片放大
[543.00s -> 545.00s] 或者说重绘
[545.00s -> 547.00s] 放大重绘
[552.00s -> 555.00s] 这个触发词的这个优先级是跟
[555.00s -> 557.00s] 一般提示词的这个
[557.00s -> 558.00s] 优先级是一样的
[558.00s -> 565.00s] 就是可以决定Lola调整的一个优先度
[565.00s -> 567.00s] 然后其他参数
[567.00s -> 568.00s] 这边是"""
